import React from "react"
import classes from "./GuaranteePage.module.scss";

const GuaranteePage: React.FC = () => {
    return (
        <>
            <div className={classes.container}>
                <h1>Гарантія</h1>

                <p>При купівлі товару в нашому магазині, надається гарантія від 14 днів до 12 місяців, в залежності від
                    товару і можливості придбання розширеної гарантії магазину. На нову техніку стандартна гарантія
                    становить 1 місяць, на техніку після вживання, гарантія становить 14 днів. Підтвердженням
                    гарантійних зобов'язань служить гарантійний талон продавця.</p>

                <div className={classes.textblock}>
                    <ul>
                        <h4>Додаткові умови гарантії на б/у техніку:</h4>

                        <li>Гарантія НЕ поширюється на комплектуючі;</li>
                        <li>На період гарантійного ремонту аналогічне справне устаткування НЕ видається;</li>
                        <li>Повернення коштів відбувається якщо пристрій повністю вийшов з ладу протягом
                            гарантійного терміну не з вини покупця і сервісний центр НЕ може усунути цю несправність.
                            В других випадках б/у техніка повернення та обміну НЕ підлягає.</li>
                    </ul>

                    <ul>
                        <h4>Гарантія анулюється у разі якщо:</h4>

                        <li>Порушено збереження гарантійних пломб;</li>
                        <li>Є механічні або інші пошкодження, які виникли в наслідок умисних, або необережних дій покупця, або третіх осіб;</li>
                        <li>Порушені правила використання, вказаних в експлуатаційних документах;</li>
                        <li>Було несанкціоноване розкриття, ремонт або змінені внутрішні комунікації та компоненти товару,
                            змінена конструкція або схеми товару;</li>
                        <li>Серійний або IMEI номер, що знаходиться в пам'яті виробу, змінений, стертий або не може бути ідентифікований;</li>
                        <li>Пошкодження, що виникли внаслідок недбалого ставлення або використання
                            (недотримання температурного режиму, вплив рідини, запиленості, механічні пошкодження, попадання всередину
                            корпусу сторонніх предметів);</li>
                        <li>Пошкодження в результаті стихійних лих (природних явищ);</li>
                        <li>Пошкодження внаслідок  ненормального функціонування виробу, спричинені використанням
                            нестандартних та (або) неякісних розхідних матеріалів, приладдя, запасних частин, елементів живлення.</li>
                    </ul>
                </div>
            </div>
        </>
    )
}

export default GuaranteePage;