import React from "react";
import classes from "./PaymentDeliveryPage.module.scss";

const PaymentDeliveryPage: React.FC = () => {
    return (
        <>
            <div className={classes.container}>
                <h1>Оплата і доставка</h1>

                <div className={classes.textblock}>
                    <ul>
                        <h4 >Оплата і доставка:</h4>
                        <li>Доставка кур’єром: ми доставляємо товари кур'єром по всій Україні протягом 2-5 робочих днів після оформлення замовлення.
                            Вартість доставки розраховується індивідуально залежно від регіону та розміру замовлення;</li>
                        <li>Доставка у відділення “Нова Пошта”: вартість доставлення сплачується отримувачем, згідно з тарифами «Нової пошти».
                            Зверніть увагу, що на 6й день зберігання посилки у відділенні, вона буде повернута до нас;</li>
                        <li>Доставка кур’єром “Нова Пошта”: доставка здійснюється службою “Нова пошта” по всій Україні. Вартість доставкі сплачується отримувачем
                            згідно з тарифів Нової пошти.</li>
                    </ul>


                    <ul>
                        <h4>Способи оплати:</h4>

                        <li>Готівкою при отриманні: Оплата здійснюється виключно у національній валюті гривні і може бути проведена в будь-якій з наших торгових
                            точок на території України;</li>
                        <li>Оплата Google Pay/Apple Pay: оплата онлайн можлива на етапі оформлення замовлення. Під час оформлення замовлення виберіть один із пунктів.
                            Для оплати Ви будете переадресовані на сторінку системи безпечних платежів, де необхідно підтвердити оплату. Сервісного збору при цьому
                            варіанті оплати немає. Під час оплати кредитними коштами може стягуватися додаткова комісія банком відправника.</li>
                    </ul>
                </div>
            </div>
        </>
    )
}

export default PaymentDeliveryPage;